<?php

declare(strict_types=1);

namespace RepeatBot\Bot\Service\CommandService\Messages;

/**
 * Class HelpMessage
 * @package RepeatBot\Bot\Service\CommandService\Messages
 */
class HelpMessage
{
    public const HELP_TEXT = "Довідка з використання бота:\n\n" .
    "викликати довідку під час тренування:\n - /help\n\n" .
    "пропустити слово:\n - Натиснути кнопку \[Я не знаю]\n - Написати українською букву Х\n" .
    " - Написати англійську букву P\n - Написати точку\n - Написати 'не знаю' або 'dont know'\n\n" .
    "надіслати слово в ітерацію never (1 рік до повторення):\n - Написати 1\n\n" .
    "видалення, скидання прогресу:\n - команда /del my progress видалення всього прогресу\n" .
    " - команда /del collection <num> для видалення конкретної колекції, де <num> це номер, наприклад 1\n" .
    " - команда /reset my progress для скидання всього прогресу\n" .
    " - команда /reset collection <num> для скидання прогресу конкретної колекції, де <num> це номер, наприклад 1\n\n" .
    "подивитися прогрес:\n - /progress\n - зайти в \[Мій прогрес] у меню тренувань(/training)\n\n" .
    "ввімкнути сповіщення зі звуком:\n - /settings\n - зайти в \[Налаштування] в головному меню (/start)\n\n" .
    "персональні повідомлення:\n - /alarm 9:00 - 9 ранку по Києву\n - /alarm 21:00 - 9 вечора по Києву\n" .
    "- /alarm MSK 19:00 - 7 вечора по Москві\n - /alarm EDT 21:00 - 9 вечора по Нью-Йорку\n" .
    " - /alarm list - список персональних нагадувань\n - /alarm reset - видалити нагадування\n" .
    " - /time - список підтримуваних кодів часових поясів\n\n" .
    "експорт слів у pdf:\n - /export - експорт всіх слів, що досліджуються\n" .
    " - /export ToEnglish first - експорт усіх слів із тренування ToEnglish в ітерації first" .
    "(наприклад не виходить нормально запам'ятати і хочеться виписати їх окремо)\n";
}
