<?php

declare(strict_types=1);

namespace RepeatBot\Bot\Service\CommandService\Messages;

/**
 * Class StartMessage
 * @package RepeatBot\Bot\Service\CommandService\Messages
 */
class StartMessage
{
    public const WELCOME_TEXT = "Вітання! Я допомагаю вивчати англійські слова за методикою інтервального повторення.\n\n" .
    "Інтервальні повторення (англ. spaced repetition) - техніка утримання у пам'яті," .
    "що полягає у повторенні запам'ятовуваного навчального матеріалу за певними, " .
    "Інтервали, що постійно зростають.\n\nЯк тільки ви правильно відповідаєте, " .
    'Слово переходить на наступну ітерацію для повторення. Усього ітерацій 7. ' .
    'Перша через добу, друга через три дні, потім через сім, потім через місяць, три, півроку та рік.' .
    "\n\nТакож користуйтесь кнопкою 'Я не знаю'. Вона допоможе Вам розібратися з новими для Вас словами." .
    ' А також не додавайте відразу занадто багато, спочатку відправте на довгі ітерації невеликі колекції. Успіхів!' .
    "\n\nP.S. Якщо раптом слово не відтворюється - надсилайте це повідомлення форвардом @setnemo в личку.";
}
